#튜플의 기초 -변경불가
tuple01 = ()

tuple02 = 1,
tuple03 = (1,) #모두 (1,)
###원소가 1개일 때는 원소 뒤에 , 쉼표를 적어야 함 안 그러면 아래 2줄처럼 단순 변수로 취급함

a01 = 1         #튜플이 아님 하나의 값을 가진 int형 변수
a02 = (1)       #튜플이 아님 하나의 값을 가진 int형 변수

tuple04 = 1, 2, 3
tuple05 = 1, 2, 3,
tuple06 = (1, 2, 3)
tuple07 = (1, 2, 3, ) #모두 (1, 2, 3)

tuple08 = 'a', 'b', 'c',    #('a', 'b', 'c')
tuple09 = tuple()           #빈 튜플
tuple10 = tuple('abc')      #('a', 'b', 'c')문자열의 각 문자로부터 원소를 생성성
tple11 = tuple([1, 2, 3])   #(1, 2, 3) 리스트로부터 원소를 생성
tuple12 = tuple({1, 2, 3})  #(1, 2, 3) 집합으로부터 원소를 생성
tuple13 = tuple(range(7))   #(0, 1, 2, 3, 4, 5, 6)
tuple14 = tuple(range(3, 8))    #(3, 4, 5, 6, 7)
tuple15 = tuple(range(3, 13, 2))#(3, 5, 7, 9, 11)
tuple16 =
tuple17 =
